<script setup></script>

<template>
  <div class="content">
    <p>你好呀，我是一个爱好编程的小白。</p>
    <p>姓名：林子雄</p>
    <p>联系电话：18523226096</p>
    <p>电子邮箱：503806316@qq.com</p>
    <p>求职意向：开发工程师</p>
    <h3>教育经历</h3>
    <div>
      <div>重庆工程学院</div>
      <div>时间：2017年9月 - 2021年6月</div>
      <div>专业：软件工程</div>
    </div>
    <p>
      概述：在校期间系统学习了软件开发的理论知识，包括C#编程语言、数据结构、算法设计、数据库原理等，对ASP.NET框架有深入的理解和实践。同时，利用课余时间自学了前端开发技术，如HTML5、CSS3、JavaScript及常用前端框架。
    </p>
    <h3>工作经历</h3>
    <div>
      <div>重庆万州海成生活服务集团</div>
      <div>时间：2024年1月 - 至今</div>
      <div>岗位：物业客服（转型中，目标重回软件开发岗位）</div>
    </div>
    <p>
      工作内容：负责日常业主咨询与投诉处理，确保服务质量与业主满意度。输出每月运营数据，各类表格，通报，以及运营PPT。
    </p>
    <p>
      利用业余时间继续深化巩固前端、C#及ASP.NET技能，保持对软件开发领域的关注与学习，为未来重回技术岗位做准备。
    </p>
    <h3>项目经历</h3>
    <p>公交卡信息管理系统（毕业设计开发）</p>
    <p>
      项目背景：为提升公交卡办理、充值、消费等管理效率，决定开发一套集公交卡信息管理、卡充值管理、卡权限管理等功能于一体的公交卡信息管理系统。
    </p>
    <p>
      项目细节： 使用ASP.NET
      MVC框架，结合SQLServer数据库设计系统架构。前后端分离开发，前端采用LayUI框架提升用户体验。
      实现了用户权限管理、公交卡信息增删改查、公交卡充值、缴费欠费停用等核心功能。
    </p>
    <p>
      项目难点：
      确保数据一致性和安全性，特别是在高并发环境下的表现。权限控制的细粒度划分，满足不同角色用户的操作需求。
      优化和改进： 引入缓存机制，提高数据查询效率。
      使用AJAX技术实现页面局部刷新，提升用户体验。
    </p>
    <h3>个人技能</h3>
    <p>办公软件：熟练使用Word、Excel、PowerPoint。</p>
    <p>编程语言：熟练掌握C#，熟悉JavaScript、HTML5、CSS3。</p>
    <p>框架技术：熟练ASP.NET MVC，了解Entity Framework、Bootstrap、Vue等。</p>
    <p>数据库：熟悉SQL Server数据库。</p>
    <p>软件工具：熟练使用Visual Studio、VSCode进行项目开发。</p>
    <p>
      自学能力：具备快速学习新技术和新框架的能力，善于通过官方文档和在线资源解决问题。
    </p>
    <p>
      沟通能力：在物业客服工作中锻炼了良好的沟通能力和服务意识，能够准确理解用户需求并提供有效解决方案。
    </p>
  </div>
</template>

<style scoped>
.content {
  line-height: 2.5;
}
</style>
